modules/Page/Controllers/PageController.php

    public function detail()
    {
        /**
         * @var Page $page
         * @var PageTranslation $translation
         */
        $slug = request()->route('slug');

        $page = Page::where('slug', $slug)->first();
---
select * from `core_pages` where `slug` = 'homepage' and `core_pages`.`deleted_at` is null limit 1