modules/Core/Admin/QuizController.php

select * from `core_quiz` limit 20 offset 0
select count(*) as aggregate from `core_quiz`
---
    public function index()
    {

        $this->checkPermission('quiz_view');
        $data = [
            'rows'           => Quiz::paginate(20),
        ];

select * from `core_quiz` limit 1 offset 0
---
    public function getFirst()
    {
        return Quiz::with('questions', 'questions.answers')->offset(0)->limit(1)->get();

select * from `core_quiz` where `core_quiz`.`id` = '58' limit 1
---
    public function edit($id)
    {

        $this->checkPermission('menu_update');
        $row = Quiz::with('questions', 'questions.answers')->find($id);

select * from `core_quiz` where `core_quiz`.`id` = '62' limit 1
---
    public function show($id)
    {
        // $this->checkPermission('quiz_view');
        $row = Quiz::with('questions', 'questions.answers')->find($id);

select * from `core_quiz` where `core_quiz`.`id` = '62' limit 1
delete from `core_quiz` where `id` = 62
---
    public function update(Request $request, $id)
    {

        // $this->checkPermission('quiz_update');
        $row = Quiz::find($id);
        if (empty($row)) {
            return redirect()->back()->with('error', __('Quiz not found!'));
        }
        $row->delete();

select * from `core_quiz` where `id` = '63' and `create_user` = 6 limit 1
---
    public function bulkEdit(Request $request)
    {
        $ids = $request->input('ids');
        $action = $request->input('action');
        if (empty($ids) or !is_array($ids)) {
            return redirect()->back()->with('error', __('No items selected!'));
        }
        if (empty($action)) {
            return redirect()->back()->with('error', __('Please select an action!'));
        }

        switch ($action) {
            case "delete":
                foreach ($ids as $id) {
                    $query = Quiz::where("id", $id);
                    $query->where("create_user", Auth::id());
                    //                    if (!$this->hasPermission('menu_update')) {
                    //                        $query->where("create_user", Auth::id());
                    //                        $this->checkPermission('menu_delete');
                    //                    }
                    $row = $query->first();

insert into `core_quiz_submission` (`name`, `email`, `contact`, `quiz_id`, `result`, `updated_at`, `created_at`) values ('Anish', 'anisgh@gmail.com', '98655436744949', 64, 'You are guts and glory, ready to conquer the world with your adventurous spirit!', '2025-06-29 22:42:57', '2025-06-29 22:42:57')
---
    public function submitQuiz(Request $request)
    {
        $data = $request->all();
        // Validate input
        $validator = Validator::make($data, [
            'answers' => 'required|array',
            'name' => 'required|string|max:255',
            'email' => 'required|email|max:255',
            'contact' => 'nullable|string|max:255',
        ]);

        if ($validator->fails()) {
            return redirect()->back()->withErrors($validator)->withInput();
        }

        $data = [
            'answers' => json_encode($data['answers']),
            'name' => $data['name'],
            'email' => $data['email'],
            'contact' => $data['contact'],
        ];

        // generate the result based the answers Selection
        $result = 'You are guts and glory, ready to conquer the world with your adventurous spirit!';

        $data['quiz_id'] = $this->getFirst()->first()->id ?? null;
        $quizSubmission =  QuizSubmission::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'contact' => $data['contact'],
            'quiz_id' => $data['quiz_id'],
            'result' => $result,
        ]);

select `id` from `core_quiz_questions` where `type` = 'range'
---
        $data = json_decode($data['answers'], true);

        // Loop through the associative array
        $rangeQuestion = QuizQuestions::where('type', 'range')->pluck('id')->toArray();

select * from `core_quiz_question_answers` where `core_quiz_questions_id` = 82
insert into `core_quiz_submission_answers` (`question_id`, `answers_id`, `quiz_submission_id`, `range_value`, `updated_at`, `created_at`) values (82, 173, 44, '', '2025-06-29 22:42:57', '2025-06-29 22:42:57')
---
            if (in_array($key, $rangeQuestion)) {
                $insertData['range_value'] = $value; // Set the range value
            } else {
                $answers = QuizQuestionAnswers::where('core_quiz_questions_id', $key)->get();
                $insertData['answers_id'] = $answers[$value]->id;
            }
            QuizSubmissionAnswers::create($insertData);